html/emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-04-02 Sat 05:08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>emacs</title>
<meta name="author" content="Ketan Agrawal" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="syntax.css" />
<link rel="stylesheet" type="text/css" href="styles.css" />
<link rel="apple-touch-icon" sizes="180x180" href="/apple-touch-icon.png" />
<link rel="icon" type="image/png" sizes="32x32" href="/favicon-32x32.png" />
<link rel="icon" type="image/png" sizes="16x16" href="/favicon-16x16.png" />
<link rel="manifest" href="/site.webmanifest" />
</head>
<body>
<div id="preamble" class="status">
<header>
  <a style="color: inherit; text-decoration: none" href="/">
    <svg id="nebula-logo" x="0px" y="0px" width="50px"
         viewBox="0 0 290.513 290.513" style="enable-background:new 0 0 290.513 290.513;" xml:space="preserve">
      <g>
        <g>
          <path d="M168.684,103.086c-58.679,0-93.713,17.515-93.713,46.857c0,18.344,27.214,28.114,46.857,28.114
                   c46.327,0,46.857-22.472,46.857-23.428l-9.367-0.141c-0.009,0.141-1.354,14.198-37.49,14.198
                   c-16.976,0-37.485-8.359-37.485-18.743c0-23.124,32.317-37.485,84.342-37.485c68.312,0,112.456,20.233,112.456,51.542
                   c0,32.818-50.989,70.252-145.49,74.975l0.469,9.357c101.36-5.065,154.393-46.262,154.393-84.333
                   C290.511,126.996,242.689,103.086,168.684,103.086z"/>
          <path d="M215.541,154.628c0-18.344-27.214-28.114-46.857-28.114c-46.327,0-46.857,22.472-46.857,23.428
                   l9.367,0.141c0.009-0.141,1.354-14.198,37.49-14.198c16.976,0,37.485,8.359,37.485,18.743c0,23.124-32.317,37.485-84.342,37.485
                   c-68.312,0-112.456-20.233-112.456-51.542c0-32.818,50.989-70.252,145.49-74.975l-0.469-9.357C53.032,61.303,0,102.5,0,140.571
                   c0,37.003,47.822,60.914,121.827,60.914C180.506,201.485,215.541,183.97,215.541,154.628z"/>
          <path d="M51.542,107.771c0,7.75-6.307,14.057-14.057,14.057v9.371c7.75,0,14.057,6.307,14.057,14.057h9.371
                   c0-7.75,6.307-14.057,14.057-14.057v-9.371c-7.75,0-14.057-6.307-14.057-14.057H51.542z M56.228,131.214
                   c-1.335-1.776-2.919-3.364-4.7-4.7c1.781-1.335,3.364-2.924,4.7-4.7c1.335,1.776,2.919,3.364,4.7,4.7
                   C59.147,127.849,57.563,129.438,56.228,131.214z"/>
          <path d="M238.969,187.428h9.371c0-10.337,8.406-18.743,18.743-18.743v-9.371
                   c-10.337,0-18.743-8.406-18.743-18.743h-9.371c0,10.337-8.406,18.743-18.743,18.743v9.371
                   C230.563,168.685,238.969,177.091,238.969,187.428z M243.655,156.095c2.08,3.13,4.775,5.82,7.905,7.905
                   c-3.13,2.08-5.82,4.775-7.905,7.905c-2.08-3.13-4.775-5.82-7.905-7.905C238.88,161.919,241.574,159.225,243.655,156.095z"/>
          <path d="M103.085,206.17h-9.371c0,10.337-8.406,18.743-18.743,18.743v9.371
                   c10.337,0,18.743,8.406,18.743,18.743h9.371c0-10.337,8.406-18.743,18.743-18.743v-9.371
                   C111.491,224.913,103.085,216.507,103.085,206.17z M98.399,237.503c-2.08-3.13-4.775-5.82-7.905-7.905
                   c3.13-2.08,5.82-4.775,7.905-7.905c2.08,3.13,4.775,5.82,7.905,7.905C103.174,231.679,100.479,234.373,98.399,237.503z"/>
          <path d="M182.741,84.343h9.371c0-10.337,8.406-18.743,18.743-18.743v-9.371
                   c-10.337,0-18.743-8.406-18.743-18.743h-9.371c0,10.337-8.406,18.743-18.743,18.743V65.6
                   C174.335,65.6,182.741,74.006,182.741,84.343z M187.427,53.01c2.08,3.13,4.775,5.82,7.905,7.905
                   c-3.13,2.08-5.82,4.775-7.905,7.905c-2.08-3.13-4.775-5.82-7.905-7.905C182.652,58.834,185.346,56.14,187.427,53.01z"/>
          <rect x="98.399" y="135.885" width="9.371" height="9.371"/>
          <rect x="107.77" y="149.942" width="9.371" height="9.371"/>
          <rect x="168.684" y="168.685" width="9.371" height="9.371"/>
          <rect x="182.741" y="145.257" width="9.371" height="9.371"/>
		  <rect x="215.541" y="187.428" width="9.371" height="9.371"/>
		  <rect x="154.627" y="215.542" width="9.371" height="9.371"/>
	    </g>
      </g>
    </svg>
  </a>
</header>
</div>
<div id="content" class="content">
<h1 class="title">emacs</h1>
<p>
I started using Emacs in January 2020, and it has undoubtedly changed the way I do work on my computer, and the way I think about computing in general.<br />
</p>

<div id="outline-container-orgead5ec7" class="outline-2">
<h2 id="orgead5ec7">Things I really like about emacs</h2>
<div class="outline-text-2" id="text-orgead5ec7">
</div>
<div id="outline-container-orgf671621" class="outline-3">
<h3 id="orgf671621">Emacs enables a personal framework of <a href="experimentation.html#ID-1096f874-fab2-4db1-88dc-b90740bf608a">experimentation</a>.</h3>
<div class="outline-text-3" id="text-orgf671621">
<p>
It's completely hackable, which easily leads to an "experimental" mindset. I feel like people don't really try tweaking the default settings of things in important ways. Granted, you can get lost in customization, and tweaking every little aesthetic and all that&#x2026;but I believe that there have been several important ways that I've been able to customize my workflow due to Emacs and the OSS that has built many different extensions for it.<br />
</p>
</div>
</div>
</div>
<div id="outline-container-org5b5d950" class="outline-2">
<h2 id="org5b5d950">Cool configs</h2>
<div class="outline-text-2" id="text-org5b5d950">
</div>
<div id="outline-container-orge5cb9cc" class="outline-3">
<h3 id="orge5cb9cc"><a href="https://gitlab.com/justinekizhak/dotfiles/blob/master/emacs/doom.d/config.org">justinekizhak</a></h3>
<div class="outline-text-3" id="text-orge5cb9cc">
<p>
I like the motivation he gives for why emacs is so damn cool. "Emacs changes how you <i>think</i> about programming." I feel like this has been very true for me. It makes many other applications seem needlessly restrictive. It feels natural to have the entire OS be an introspectable operating system.<br />
</p>
</div>
</div>
<div id="outline-container-org7e90edc" class="outline-3">
<h3 id="org7e90edc"><a href="https://github.com/larstvei/dot-emacs">larstvei</a></h3>
</div>
<div id="outline-container-org3a9d3e5" class="outline-3">
<h3 id="org3a9d3e5"><a href="https://github.com/danielmai/.emacs.d/blob/master/config.org">danielmai</a></h3>
</div>
<div id="outline-container-orge943349" class="outline-3">
<h3 id="orge943349"><a href="https://tecosaur.github.io/emacs-config/config.html">tecosaur</a></h3>
</div>
<div id="outline-container-orgc288736" class="outline-3">
<h3 id="orgc288736"><a href="https://github.com/jethrokuan/dots/blob/master/.doom.d/config.el">jethro</a></h3>
</div>
</div>
<div id="outline-container-org4744199" class="outline-2">
<h2 id="org4744199">skills I am learning</h2>
<div class="outline-text-2" id="text-org4744199">
</div>
<div id="outline-container-ID-d4ae4b67-706b-4977-9299-d3667eb940ed" class="outline-3">
<h3 id="ID-d4ae4b67-706b-4977-9299-d3667eb940ed">become a master of <a href="debugging.html#ID-2baa1991-e3c3-4b37-8703-296cda53a9a0">debugging</a> in emacs</h3>
<div class="outline-text-3" id="text-org264b974">
<p>
Something crashing? Use <a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Edebug.html">Edebug</a> to debug it. Something slow? You can easily <a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Profiling.html">profile</a> it.<br />
</p>
</div>
</div>
<div id="outline-container-org33ecd5c" class="outline-3">
<h3 id="org33ecd5c">lisp macros</h3>
<div class="outline-text-3" id="text-org33ecd5c">
<p>
Really powerful feature that allows one to define domain-specific syntax <i>within</i> Emacs Lisp. Examples I really like include <a href="https://github.com/alphapapa/org-ql">org-ql</a>, <a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Rx-Notation.html">rx notation</a>, and so many more that enable someone to write expressive, parsimonious code in a <a href="programming_bottom_up.html#ID-95ff3fb3-f886-41df-9f4f-5f9223b4ca4e">bottom-up</a> fashion.<br />
</p>
</div>
</div>
</div>


<div id="outline-container-org0d802e8" class="outline-2 references">
<h2 id="org0d802e8">Links to this node</h2>
<div class="outline-text-2" id="text-org0d802e8">
</div>
<div id="outline-container-org4dad69e" class="outline-3">
<h3 id="org4dad69e"><a href="musings.html#ID-e2ff4d71-a630-4a8d-94d4-66606f321bd4">musings</a></h3>
</div>
</div>

<div id="outline-container-orgc6f1002" class="outline-2">
<h2 id="orgc6f1002">Computation in brains must be deeply <a href="context.html#ID-8d27adad-158b-4fa4-b31b-5f793d0b8341">context</a>-aware.</h2>
<div class="outline-text-2" id="text-orgc6f1002">
</div>
<div id="outline-container-org5adbc39" class="outline-3">
<h3 id="org5adbc39"><a href="programming_bottom_up.html#ID-95ff3fb3-f886-41df-9f4f-5f9223b4ca4e">Programming Bottom-Up</a></h3>
<div class="outline-text-3" id="text-org5adbc39">
<p>
<a href="http://www.paulgraham.com/progbot.html">http://www.paulgraham.com/progbot.html</a><br />
</p>

<p>
There are two ways of <a href="programming.html#ID-0997b060-ee05-458e-beed-3494675c879d">programming</a> in Lisp &#x2013; top-down, and bottom-up.<br />
</p>

<p>
Top-down = the classic paradigm of divide-and conquer, decomposing the problem hierarchically into smaller problems.<br />
</p>

<p>
Bottom-up = defining your own DSL in Lisp, and using those primitives to make something cool.<br />
</p>

<p>
Most programming is done top-down, but with the powers of macros you can go bottom-up, creating "little universes" in Lisp&#x2026;<br />
</p>

<p>
Personally what comes to mind is the <code>rx</code> macro in emacs. It's like a nice little domain-specific language for writing regular expressions, embedded right into elisp.<br />
</p>

<p>
Regexp matching a block comment in C:<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp" data-language="emacs-lisp">(<span class="org-keyword">rx</span> <span class="org-string">"/*"</span>                          <span class="org-comment-delimiter">; </span><span class="org-comment">Initial /*</span>
    (zero-or-more
     (<span class="org-keyword">or</span> (not (any <span class="org-string">"*"</span>))          <span class="org-comment-delimiter">;  </span><span class="org-comment">Either non-*,</span>
         (seq <span class="org-string">"*"</span>                 <span class="org-comment-delimiter">;  </span><span class="org-comment">or * followed by</span>
              (not (any <span class="org-string">"/"</span>)))))  <span class="org-comment-delimiter">;  </span><span class="org-comment">non-/</span>
    (one-or-more <span class="org-string">"*"</span>)             <span class="org-comment-delimiter">; </span><span class="org-comment">At least one star,</span>
    <span class="org-string">"/"</span>)                          <span class="org-comment-delimiter">; </span><span class="org-comment">and the final /</span>
</pre>
</div>

<pre class="example">
/\*\(?:[^*]\|\*[^/]\)*\*+/
</pre>


<p>
you redefine <i>the language itself</i> to have the primitives you want it to have, and then you can proceed to build something (perhaps in top-down fashion now.) It's like "meeting in the middle," so you don't have to build up super complex primitives, and you don't have to decompose down to a super fine-grained level.<br />
</p>

<p>
I wonder what the connection between this bottom-up paradigm and Bret Victor - The Future of Programming is. I feel like maybe there's an idea that his visual programming playgrounds are like a domain-specific language (albeit not in Lisp.) They give the user a powerful set of primitives to manipulate digital objects, and the user can then build from there to make it come to life.<br />
</p>

<p>
Also feel like <a href="emacs.html#ID-1999996d-b676-4fc4-894b-caf82f8dd7ff">emacs</a> encourages bottom-up programming in some ways, well ofc because of Lisp, but also because of the interactivity of the environment. You write a snippet, and immediately you can evaluate that code and test out your snippet. You get a couple more snippets, try those out, and then it's like, ok cool, what else can I build with these snippets?<br />
</p>
</div>
</div>
</div>


<div id="outline-container-org018e6b8" class="outline-2 references">
<h2 id="org018e6b8">Links to this node</h2>
<div class="outline-text-2" id="text-org018e6b8">
</div>
<div id="outline-container-org834ff99" class="outline-3">
<h3 id="org834ff99"><a href="musings.html#ID-e2ff4d71-a630-4a8d-94d4-66606f321bd4">musings</a></h3>
</div>
</div>

<div id="outline-container-orge4ee05b" class="outline-2">
<h2 id="orge4ee05b">Computation in brains must be deeply <a href="context.html#ID-8d27adad-158b-4fa4-b31b-5f793d0b8341">context</a>-aware.</h2>
<div class="outline-text-2" id="text-orge4ee05b">
</div>
<div id="outline-container-org7c2ad95" class="outline-3">
<h3 id="org7c2ad95"><a href="programming_bottom_up.html#ID-95ff3fb3-f886-41df-9f4f-5f9223b4ca4e">Programming Bottom-Up</a></h3>
<div class="outline-text-3" id="text-org7c2ad95">
<p>
<a href="http://www.paulgraham.com/progbot.html">http://www.paulgraham.com/progbot.html</a><br />
</p>

<p>
There are two ways of <a href="programming.html#ID-0997b060-ee05-458e-beed-3494675c879d">programming</a> in Lisp &#x2013; top-down, and bottom-up.<br />
</p>

<p>
Top-down = the classic paradigm of divide-and conquer, decomposing the problem hierarchically into smaller problems.<br />
</p>

<p>
Bottom-up = defining your own DSL in Lisp, and using those primitives to make something cool.<br />
</p>

<p>
Most programming is done top-down, but with the powers of macros you can go bottom-up, creating "little universes" in Lisp&#x2026;<br />
</p>

<p>
Personally what comes to mind is the <code>rx</code> macro in emacs. It's like a nice little domain-specific language for writing regular expressions, embedded right into elisp.<br />
</p>

<p>
Regexp matching a block comment in C:<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp" data-language="emacs-lisp">(<span class="org-keyword">rx</span> <span class="org-string">"/*"</span>                          <span class="org-comment-delimiter">; </span><span class="org-comment">Initial /*</span>
    (zero-or-more
     (<span class="org-keyword">or</span> (not (any <span class="org-string">"*"</span>))          <span class="org-comment-delimiter">;  </span><span class="org-comment">Either non-*,</span>
         (seq <span class="org-string">"*"</span>                 <span class="org-comment-delimiter">;  </span><span class="org-comment">or * followed by</span>
              (not (any <span class="org-string">"/"</span>)))))  <span class="org-comment-delimiter">;  </span><span class="org-comment">non-/</span>
    (one-or-more <span class="org-string">"*"</span>)             <span class="org-comment-delimiter">; </span><span class="org-comment">At least one star,</span>
    <span class="org-string">"/"</span>)                          <span class="org-comment-delimiter">; </span><span class="org-comment">and the final /</span>
</pre>
</div>

<pre class="example">
/\*\(?:[^*]\|\*[^/]\)*\*+/
</pre>


<p>
you redefine <i>the language itself</i> to have the primitives you want it to have, and then you can proceed to build something (perhaps in top-down fashion now.) It's like "meeting in the middle," so you don't have to build up super complex primitives, and you don't have to decompose down to a super fine-grained level.<br />
</p>

<p>
I wonder what the connection between this bottom-up paradigm and Bret Victor - The Future of Programming is. I feel like maybe there's an idea that his visual programming playgrounds are like a domain-specific language (albeit not in Lisp.) They give the user a powerful set of primitives to manipulate digital objects, and the user can then build from there to make it come to life.<br />
</p>

<p>
Also feel like <a href="emacs.html#ID-1999996d-b676-4fc4-894b-caf82f8dd7ff">emacs</a> encourages bottom-up programming in some ways, well ofc because of Lisp, but also because of the interactivity of the environment. You write a snippet, and immediately you can evaluate that code and test out your snippet. You get a couple more snippets, try those out, and then it's like, ok cool, what else can I build with these snippets?<br />
</p>
</div>
</div>

<div id="outline-container-org151f3cc" class="outline-3">
<h3 id="org151f3cc"><a href="org_mode.html#ID-b6a1ff64-eae1-4a6f-ab54-01ddfca5353d">org-mode</a></h3>
<div class="outline-text-3" id="text-org151f3cc">
<p>
An integral part of <a href="emacs.html#ID-1999996d-b676-4fc4-894b-caf82f8dd7ff">emacs</a> .<br />
</p>
</div>
</div>

<div id="outline-container-orgfa9d98c" class="outline-3">
<h3 id="orgfa9d98c"><a href="emacs.html#ID-1999996d-b676-4fc4-894b-caf82f8dd7ff">emacs</a></h3>
<div class="outline-text-3" id="text-orgfa9d98c">
</div>
<div id="outline-container-org77794df" class="outline-4">
<h4 id="org77794df">(<i>Computation in brains must be deeply context-aware. &gt; Programming Bottom-Up</i>)</h4>
<div class="outline-text-4" id="text-org77794df">
<p>
<a href="http://www.paulgraham.com/progbot.html">http://www.paulgraham.com/progbot.html</a><br />
</p>

<p>
There are two ways of <a href="programming.html#ID-0997b060-ee05-458e-beed-3494675c879d">programming</a> in Lisp &#x2013; top-down, and bottom-up.<br />
</p>

<p>
Top-down = the classic paradigm of divide-and conquer, decomposing the problem hierarchically into smaller problems.<br />
</p>

<p>
Bottom-up = defining your own DSL in Lisp, and using those primitives to make something cool.<br />
</p>

<p>
Most programming is done top-down, but with the powers of macros you can go bottom-up, creating "little universes" in Lisp&#x2026;<br />
</p>

<p>
Personally what comes to mind is the <code>rx</code> macro in emacs. It's like a nice little domain-specific language for writing regular expressions, embedded right into elisp.<br />
</p>

<p>
Regexp matching a block comment in C:<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp" data-language="emacs-lisp">(<span class="org-keyword">rx</span> <span class="org-string">"/*"</span>                          <span class="org-comment-delimiter">; </span><span class="org-comment">Initial /*</span>
    (zero-or-more
     (<span class="org-keyword">or</span> (not (any <span class="org-string">"*"</span>))          <span class="org-comment-delimiter">;  </span><span class="org-comment">Either non-*,</span>
         (seq <span class="org-string">"*"</span>                 <span class="org-comment-delimiter">;  </span><span class="org-comment">or * followed by</span>
              (not (any <span class="org-string">"/"</span>)))))  <span class="org-comment-delimiter">;  </span><span class="org-comment">non-/</span>
    (one-or-more <span class="org-string">"*"</span>)             <span class="org-comment-delimiter">; </span><span class="org-comment">At least one star,</span>
    <span class="org-string">"/"</span>)                          <span class="org-comment-delimiter">; </span><span class="org-comment">and the final /</span>
</pre>
</div>

<pre class="example">
/\*\(?:[^*]\|\*[^/]\)*\*+/
</pre>


<p>
you redefine <i>the language itself</i> to have the primitives you want it to have, and then you can proceed to build something (perhaps in top-down fashion now.) It's like "meeting in the middle," so you don't have to build up super complex primitives, and you don't have to decompose down to a super fine-grained level.<br />
</p>

<p>
I wonder what the connection between this bottom-up paradigm and Bret Victor - The Future of Programming is. I feel like maybe there's an idea that his visual programming playgrounds are like a domain-specific language (albeit not in Lisp.) They give the user a powerful set of primitives to manipulate digital objects, and the user can then build from there to make it come to life.<br />
</p>

<p>
Also feel like <a href="emacs.html#ID-1999996d-b676-4fc4-894b-caf82f8dd7ff">emacs</a> encourages bottom-up programming in some ways, well ofc because of Lisp, but also because of the interactivity of the environment. You write a snippet, and immediately you can evaluate that code and test out your snippet. You get a couple more snippets, try those out, and then it's like, ok cool, what else can I build with these snippets?<br />
</p>
</div>
</div>
</div>

<div id="outline-container-org524460a" class="outline-3">
<h3 id="org524460a"><a href="index.html#ID-23e03a28-48b1-4fa3-9fa3-71a369950c6d">Ketan's Nebula</a></h3>
<div class="outline-text-3" id="text-org524460a">
<p>
<a href="course_notes.html#ID-6d2c6f5c-f8c1-4b38-a01a-6adcdbfe8e7a">course notes</a><br />
<a href="book_notes.html#ID-b910e58f-f1fe-4c3f-8efb-69bfa261b191">book notes</a><br />
<a href="philosophy.html#ID-091329e5-7896-4975-b88b-99b30f4dd482">philosophy</a><br />
<a href="representations.html#ID-c7ba956c-67ad-4b8e-9c7f-f18bc1b2b4ff">representations</a><br />
<a href="shortcuts.html#ID-058bef0b-aba6-4ac6-b4ae-b3c7b7e22040">shortcuts</a><br />
<a href="emacs.html#ID-1999996d-b676-4fc4-894b-caf82f8dd7ff">emacs</a><br />
<a href="programming.html#ID-0997b060-ee05-458e-beed-3494675c879d">programming</a><br />
<a href="social_psychology.html#ID-3db1ed04-4b29-46cf-9940-1afd30d5d25f">Social Psychology</a><br />
<a href="cs152_trust_and_safety_engineering.html#ID-0e008aa4-63a2-4ae3-8c59-933b3065d721">Trust and Safety Engineering</a><br />
<a href="cs144_introduction_to_computer_networking.html#ID-9908ac8d-fadd-4fe6-a78c-c3471cc36ea1">Computer Networking</a><br />
<a href="how_i_made_this_website.html#ID-65b7c2dd-ad4c-465f-b382-4e4d431e0be8">How I made this website</a><br />
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer>
  <p>Made with <span class="heart">♥</span> using
    <a href="https://orgmode.org/">org-mode</a>.
    Source code is available
    <a href="https://github.com/ketan0/digital-laboratory">here</a>.
  </p>
</footer>
<script src="popper.min.js"></script>
<script src="tippy-bundle.umd.min.js"></script>
<script src="tooltips.js"></script>
<script src="dark-themes.js"></script>
</div>
</body>
</html>
